#### ✅ Terragrunt Plan
<details><summary>Show Plan</summary>

```
time=2026-01-08T23:53:52Z level=info msg=The stack at /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace-secondary

Group 2
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base-secondary

Group 3
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps-secondary



Initializing the backend...

Initializing the backend...

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to OpenTofu
- Finding latest version of hashicorp/external...

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to OpenTofu
- Reusing previous version of rackerlabs/spot from the dependency lock file
- Reusing previous version of rackerlabs/spot from the dependency lock file
- Finding latest version of hashicorp/external...
- Installing hashicorp/external v2.3.5...
- Installing rackerlabs/spot v0.1.4...
- Installed hashicorp/external v2.3.5 (signed, key ID 0C0AF313E5FD9F80)
- Installing rackerlabs/spot v0.1.4...
- Installed rackerlabs/spot v0.1.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Installed rackerlabs/spot v0.1.4. Signature validation was skipped due to the registry not containing GPG keys for this provider

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installing hashicorp/external v2.3.5...
- Installed hashicorp/external v2.3.5 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
spot_cloudspace.this: Refreshing state... [id=matchpoint-runners]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.external.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "kubeconfig" {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "./scripts/fetch-kubeconfig.sh",
        ]
      + query   = {
          + "cluster_name" = "matchpoint-runners-2"
        }
      + result  = (known after apply)
    }

  # spot_cloudspace.this will be created
  + resource "spot_cloudspace" "this" {
      + bids                  = (known after apply)
      + cloudspace_name       = "matchpoint-runners-2"
      + cni                   = "calico"
      + deployment_type       = "gen2"
      + first_ready_timestamp = (known after apply)
      + hacontrol_plane       = false
      + id                    = (known after apply)
      + kubernetes_version    = "1.31.1"
      + last_updated          = (known after apply)
      + name                  = (known after apply)
      + pending_allocations   = (known after apply)
      + region                = "us-central-dfw-1"
      + spotnodepool_ids      = (known after apply)
      + wait_until_ready      = false
    }

  # spot_spotnodepool.this will be created
  + resource "spot_spotnodepool" "this" {
      + autoscaling          = {
          + max_nodes = 12
          + min_nodes = 2
        }
      + bid_price            = 0.35
      + bid_status           = (known after apply)
      + cloudspace_name      = "matchpoint-runners-2"
      + desired_server_count = (known after apply)
      + id                   = (known after apply)
      + last_updated         = (known after apply)
      + name                 = (known after apply)
      + server_class         = "gp.vs1.xlarge-dfw"
      + won_count            = (known after apply)
    }

  # terraform_data.setup_spotctl_config will be created
  + resource "terraform_data" "setup_spotctl_config" {
      + id               = (known after apply)
      + triggers_replace = [
          + "matchpoint-runners-2",
        ]
    }

  # terraform_data.wait_for_cluster will be created
  + resource "terraform_data" "wait_for_cluster" {
      + id               = (known after apply)
      + triggers_replace = [
          + (known after apply),
        ]
    }

  # terraform_data.wait_for_nodepool will be created
  + resource "terraform_data" "wait_for_nodepool" {
      + id               = (known after apply)
      + triggers_replace = [
          + (known after apply),
        ]
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudspace_name        = "matchpoint-runners-2"
  + cloudspace_status      = (known after apply)
  + cluster_ca_certificate = (sensitive value)
  + cluster_endpoint       = (known after apply)
  + cluster_token          = (sensitive value)
  + kubeconfig_raw         = (sensitive value)
  + node_scaling           = {
      + max = 12
      + min = 2
    }
  + nodepool_name          = (known after apply)
  + region                 = "us-central-dfw-1"
  + server_class           = "gp.vs1.xlarge-dfw"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
spot_spotnodepool.this: Refreshing state... [id=e79b74b3-b777-40c5-a5c8-426f39f8ce67]
time=2026-01-08T23:53:58Z level=info msg=Skipping terragrunt module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base-secondary/terragrunt.hcl due to skip = true. prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base-secondary] 
terraform_data.setup_spotctl_config: Refreshing state... [id=28e19691-e59e-726f-789c-9b6a9601c876]
terraform_data.wait_for_cluster: Refreshing state... [id=00552ded-818c-a14d-9136-f383592e016c]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.external.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "kubeconfig" {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "./scripts/fetch-kubeconfig.sh",
        ]
      + query   = {
          + "cluster_name" = "matchpoint-runners"
        }
      + result  = (known after apply)
    }

  # terraform_data.wait_for_nodepool will be created
  + resource "terraform_data" "wait_for_nodepool" {
      + id               = (known after apply)
      + triggers_replace = [
          + "e79b74b3-b777-40c5-a5c8-426f39f8ce67",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ cloudspace_status      = "Ready" -> (known after apply)
  ~ cluster_ca_certificate = (sensitive value)
  ~ cluster_endpoint       = "https://hcp-0ac06405-cc3a-4757-950a-2fa102a423d7.spot.rackspace.com" -> (known after apply)
  ~ cluster_token          = (sensitive value)
  ~ kubeconfig_raw         = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
time=2026-01-08T23:53:59Z level=info msg=Skipping terragrunt module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps-secondary/terragrunt.hcl due to skip = true. prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps-secondary] 

Initializing the backend...

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Installing hashicorp/kubernetes v3.0.1...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Installing hashicorp/helm v3.1.1...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
kubernetes_namespace_v1.argocd: Refreshing state... [id=argocd]
helm_release.argocd: Refreshing state... [id=argocd]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
```
</details>